app/views/pages/search.html.erb

SELECT "stripe_accounts".* FROM "stripe_accounts" WHERE (lower(first_name) LIKE 'hello')
---
    % @results.each do |result| %>
        %= result.stripeaccount.first_name %> %= result.title %><br>