app/controllers/campaigns_controller.rb

  def home
    #fundraisers
    @campaigns = Campaign.where(active: true).order(created_at: :desc).page params[:page]
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."active" = ? ORDER BY "campaigns"."created_at" DESC LIMIT ? OFFSET ?  [["active", "t"], ["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "campaigns" WHERE "campaigns"."active" = ? LIMIT ? OFFSET ?) subquery_for_count  [["active", "t"], ["LIMIT", 6], ["OFFSET", 0]]

  def create
    #create fundraiser
    @campaign = current_user.campaigns.new(campaign_params)

        #show fundraiser
        if @campaign.save
---
INSERT INTO `campaigns` (`user_id`, `title`, `description`, `created_at`, `updated_at`, `image`, `goal`) VALUES (1, 'Gift Wrapping', 'Many people enjoy wrapping gifts for holidays, but there are also many people who would gladly pay to have someone else, and we are here to do it!', '2018-12-05 15:16:36', '2018-12-05 15:16:36', '', 100)

  def show
    #find fundraiser
    @campaign = Campaign.find(params[:id])

    #charges
    @charges = Charge.where(campaign_id: @campaign.id, amount_refunded: nil).order(created_at: :desc)
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT `charges`.* FROM `charges` WHERE `charges`.`campaign_id` = 1 AND `charges`.`amount_refunded` IS NULL ORDER BY `charges`.`created_at` DESC

  def dashboard
    #fundraiser for signed user
    @campaigns = current_user.campaigns.order(created_at: :desc)
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."user_id" = ? ORDER BY "campaigns"."created_at" DESC  [["user_id", 1]]

        def edit

          @campaign = Campaign.find(params[:id])
---
SELECT  `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 1 LIMIT 1

        def update

          @campaign = Campaign.find(params[:id])


          if @campaign.update_attributes(campaign_params)
---
SELECT  `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 1 LIMIT 1
UPDATE `campaigns` SET `image` = 'cake', `updated_at` = '2018-12-08 07:20:34' WHERE `campaigns`.`id` = 1

  def destroy

    campaign = Campaign.find(params[:id])

    if campaign.update_attributes(active: false)
---
SELECT  `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 1 LIMIT 1
UPDATE `campaigns` SET `active` = 0, `updated_at` = '2018-12-06 06:08:40' WHERE `campaigns`.`id` = 1