app/controllers/charges_controller.rb

SELECT  `campaigns`.* FROM `campaigns` WHERE `campaigns`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `charges` (`charge_id`, `amount`, `campaign_id`, `created_at`, `updated_at`, `name`) VALUES ('ch_1Df0FdDMvHWkZ1Y2x8dmI1AE', 1000, 1, '2018-12-08 07:29:29', '2018-12-08 07:29:29', 'Example')
---
  def create
#check for stripe
    unless charge_params[:stripeToken]
      flash[:error] = "No payment information submitted"
      redirect_back(fallback_location: root_path) and return
    end

    #check fundraiser
    unless charge_params[:campaign] && Campaign.exists?(charge_params[:campaign])
      flash[:error] = "The fundraiser you specified doesn't exist"
      redirect_back(fallback_location: root_path) and return
    end


    campaign = Campaign.find(params[:campaign])

#user id and fundraiser
    begin

      account_id = User.find(campaign.user_id).stripe_account


      amount = (100 * charge_params[:amount].tr('$', '').to_r).to_i

      charge = Stripe::Charge.create({
            source: charge_params[:stripeToken],
            amount: amount,
            currency: "usd",
            application_fee: amount/10, #maaybe charge 10% for it?
            destination: account_id,
            metadata: { "name" => charge_params[:name], "campaign" => campaign.id }
            }
      )

UPDATE `campaigns` SET `raised` = 1000, `updated_at` = '2018-12-08 07:29:29' WHERE `campaigns`.`id` = 1
---

      #amount raising
      campaign.raised = campaign.raised.to_i + amount
      campaign.save