app/controllers/organizations_controller.rb

  def show
  	@organization = Organization.find(params[:id])
---
SELECT  `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1

  def create
  	@organization = Organization.new(org_params)
  	if @organization.save
---
INSERT INTO `organizations` (`name`, `email`, `created_at`, `updated_at`) VALUES ('Marissa', 'marissa.jain@gmail.com', '2018-12-12 10:32:39', '2018-12-12 10:32:39')