app/controllers/pages_controller.rb

SELECT `users`.* FROM `users` WHERE (lower(organization) LIKE '%so%')
---
def search

	if params[:search].blank?
    redirect_to(root_path, alert: "Empty field!") and return
  else
    @parameter = params[:search].downcase
    @results = User.all.where("lower(email) LIKE :search", search: "%#{@parameter}%")