app/controllers/registrations_controller.rb

INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('swe@example.com', '$2a$11$5bOTYvDfQQMQClzf1jjbh.eSyWRmBlJ7YHoW8dX8Q2m7uI.2QMoy2', '2018-12-04 15:35:06', '2018-12-04 15:35:06')
---
  def create
    @user = User.new(user_params)
    if @user.save