app/controllers/stripe_accounts_controller.rb

INSERT INTO `stripe_accounts` (`first_name`, `last_name`, `account_type`, `dob_month`, `dob_day`, `dob_year`, `created_at`, `updated_at`, `address_city`, `address_state`, `address_line1`, `address_postal`, `tos`, `ssn_last_4`) VALUES ('Daniela', 'Tamayo', 'individual', 1, 1, 1912, '2018-12-05 15:52:37', '2018-12-05 15:52:37', 'Edinburg', 'TX', '1201 W University Dr', '78539', 1, '0000')
---
  def create
    @account = StripeAccount.new(account_params)

    if @account.save

UPDATE "stripe_accounts" SET "updated_at" = ?, "acct_id" = ? WHERE "stripe_accounts"."id" = ?  [["updated_at", "2018-12-02 21:24:08.961968"], ["acct_id", "acct_1Dd2Q6JIUT1FcDcM"], ["id", 7]]
---

      #id
      @account.acct_id = stripe_account.id
      @account.save

UPDATE "users" SET "stripe_account" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["stripe_account", "acct_1Dd2Q6JIUT1FcDcM"], ["updated_at", "2018-12-02 21:24:09.007025"], ["id", 1]]
---



      if current_user.save

SELECT  "stripe_accounts".* FROM "stripe_accounts" WHERE "stripe_accounts"."acct_id" = ? LIMIT ?  [["acct_id", "acct_1Dd2SwJkqtD9LMeI"], ["LIMIT", 1]]
---
  def edit
    #stripe account
    unless params[:id] && params[:id].eql?(current_user.stripe_account)
      flash[:error] = "No Stripe account specified"
      redirect_to dashboard_path and return
    end

    @stripe_account = Stripe::Account.retrieve(params[:id])
    @account = StripeAccount.find_by(acct_id: params[:id])